---
kind: property
id: P:Autodesk.Revit.DB.SpatialElement.Location
source: html/63092169-7a50-9b92-d886-f741adc211ec.htm
---
# Autodesk.Revit.DB.SpatialElement.Location Property

The location of the element.

## Syntax (C#)
```csharp
public override Location Location { get; }
```

## Remarks
This is the location of the room within the level. The
Z location should be the elevation of the level and not changeable.